Revit 2026 API

# ComboBoxMemberData Constructor

---

Constructs a new instance of ComboBoxMemberData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComboBoxMemberData(
	string name,
	string text
)
```
```vb
Public Sub New (
	name As String,
	text As String
)
```
```cpp
public:
ComboBoxMemberData(
	String^ name,
	String^ text
)
```
```fsharp
new :
        name : string *
        text : string -> ComboBoxMemberData
```

#### Parameters

name String
    The internal name of the ComboBoxMember.
text String
    The user visible text seen on the item.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for one or more arguments. |
| ArgumentException | Thrown when an empty string is passed for one or more arguments. |

#### Reference

ComboBoxMemberData Class

Autodesk.Revit.UI Namespace